  DeviceEvents
  | where Timestamp > ago(7d)
  | where ActionType == "AntivirusDetection"
  | extend DetectionType =parse_json(AdditionalFields)
  | project Timestamp, DeviceId, DeviceName, ActionType, DetectionType.ReportSource, DetectionType.ThreatName
  | summarize ThreatNumber= count() by tostring(DetectionType_ThreatName)
  | sort by ThreatNumber desc 
